//AUTHRUN  JOB (DEMO),
//             'AUTHORIZED LIBRARY TEST',
//             CLASS=A,MSGCLASS=X,
//             NOTIFY=&SYSUID
//*
//STEP1    EXEC PGM=USRPRIV
//STEPLIB  DD DSN=USER.LOADLIB,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DUMMY
